Pandas Dataframes

In [1]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
from numpy.random import randn

In [5]:
np.random.seed(101)

In [15]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) #Use tab key for autocompletion

In [16]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [17]:
df['W'] #Grab one column

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [18]:
type(df['W'])

pandas.core.series.Series

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df.W #Alternative way of grabbing a column

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [21]:
df[['W','Z']] #Grabbing a list of columns

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [30]:
df['NEW'] = df['W']+df['Y']

In [31]:
df

          W         X         Y         Z       NEW
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [32]:
df.drop('NEW', axis=1, inplace=True) #Axis = 1 for columns! Axis = 0 for rows

In [33]:
#Shift tab for information about a method/function

In [34]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [36]:
df.drop('E', axis=0) #drop row

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [37]:
df.loc['A'] #returns a series. Selecting label

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [38]:
df.iloc[0] #Same as above -> select row index

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [40]:
df.loc['B','Y'] #Prints the value on coordinates B-->Y

-0.031579143908112575

In [41]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [42]:
df.loc[['A','B'], ['W','Y']] #Create a subset

          W         Y
A -0.993263 -1.136645
B  1.025984 -0.031579

In [44]:
df.max()

W    2.154846
X    1.862864
Y    0.558769
Z    1.024810
dtype: float64

In [46]:
df.min()

W   -0.993263
X   -0.610259
Y   -1.136645
Z   -0.346419
dtype: float64

# ****************************************************************************************************
PART 2

Conditional selection

In [47]:
df[df>0] #NaN = null

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [49]:
df['W'] > 0

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [50]:
df[df['W']>0] #Lists only values that are true according to the statement

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [51]:
df[df['Z'] <0] #Get the entire row in return since the format is still a dataframe

          W         X         Y         Z
C  2.154846 -0.610259 -0.755325 -0.346419

In [52]:
resultdf = df[df['W'] >0]

In [53]:
resultdf

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [54]:
resultdf['X']

B   -0.156598
C   -0.610259
D   -0.479448
Name: X, dtype: float64

In [57]:
df[df['W'] > 0]['X'] #Same as above but one liner

          Y         X
B -0.031579 -0.156598
C -0.755325 -0.610259
D  0.558769 -0.479448

In [58]:
df[df['W'] > 0][['Y','X']] #Choosing two columns

          Y         X
B -0.031579 -0.156598
C -0.755325 -0.610259
D  0.558769 -0.479448

In [59]:
df[(df['W']>0) & (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [60]:
df.reset_index #reset_index(inplace_True) if you want to keep the changes

<bound method DataFrame.reset_index of           W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478>

In [61]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [62]:
new_ind = 'CA NY WY OR CO'.split() #Quick way of creating a list!!

In [63]:
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [65]:
df['States'] = new_ind

In [66]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [68]:
df.set_index('States') #Again --> need to have inplace=True to keep changes

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

In [69]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [71]:
df.set_index('States',inplace=True)

In [72]:
df

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

#Dataframes part 3

In [73]:
#Index levels
outside = ('G1 G1 G1 G2 G2 G2').split()

In [76]:
inside = ('1 2 3 1 2 3').split()

In [77]:
hier_index = list(zip(outside, inside))

In [78]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [79]:
inside

['1', '2', '3', '1', '2', '3']

In [80]:
hier_index

MultiIndex(levels=[['G1', 'G2'], ['1', '2', '3']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [81]:
df = pd.DataFrame(randn(6,2), hier_index, ['A','B'])

In [82]:
df #Dataframe with multilevel index hierarchy

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [87]:
df.loc['G1']

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [88]:
df.index.names

FrozenList([None, None])

In [89]:
df.index.names = ['Groups','Num'] #Add labels to the indexes

In [90]:
df.index.names

FrozenList(['Groups', 'Num'])

In [91]:
df

                   A         B
Groups Num
G1     1    0.386030  2.084019
       2   -0.376519  0.230336
       3    0.681209  1.035125
G2     1   -0.031160  1.939932
       2   -1.005187 -0.741790
       3    0.187125 -0.732845

In [98]:
df.loc['G2']['B'][2] #Unwrap the values you want to display in multilevel indexing

-0.7328451475428807

In [99]:
df

                   A         B
Groups Num
G1     1    0.386030  2.084019
       2   -0.376519  0.230336
       3    0.681209  1.035125
G2     1   -0.031160  1.939932
       2   -1.005187 -0.741790
       3    0.187125 -0.732845

In [103]:
df.loc['G1']['A'][1]

-0.37651867524923904

In [107]:
df

                   A         B
Groups Num
G1     1    0.386030  2.084019
       2   -0.376519  0.230336
       3    0.681209  1.035125
G2     1   -0.031160  1.939932
       2   -1.005187 -0.741790
       3    0.187125 -0.732845

In [112]:
df.xs('1', level='Num') #Gives values of Num 1 in both G1 and G2

              A         B
Groups
G1      0.38603  2.084019
G2     -0.03116  1.939932